{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer Plugin"
					},
					"Translation":
					{
						"Text": "簡易な一括リネームプラグイン"
					},
					"Key": "EasyBatchRenamer"
				}
			]
		},
		{
			"Namespace": "FEasyBatchRenamerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer"
					},
					"Translation":
					{
						"Text": "簡易な一括リネームツール"
					},
					"Key": "FEasyBatchRenamerTabTitle"
				}
			]
		},
		{
			"Namespace": "SRenamerWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Actor"
					},
					"Translation":
					{
						"Text": "Actor"
					},
					"Key": "ItemType_Actor"
				},
				{
					"Source":
					{
						"Text": "Add prefix..."
					},
					"Translation":
					{
						"Text": "接頭辞を追加..."
					},
					"Key": "PrefixTextHint"
				},
				{
					"Source":
					{
						"Text": "Add suffix..."
					},
					"Translation":
					{
						"Text": "接尾辞を追加..."
					},
					"Key": "SuffixTextHint"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "リネームを適用"
					},
					"Key": "ApplyRenameButton"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "リネームを適用"
					},
					"Key": "ApplyRenameTransaction"
				},
				{
					"Source":
					{
						"Text": "Asset"
					},
					"Translation":
					{
						"Text": "Asset"
					},
					"Key": "ItemType_Asset"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Failed"
					},
					"Translation":
					{
						"Text": "一括リネームに失敗しました"
					},
					"Key": "RenameFailed"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Info"
					},
					"Translation":
					{
						"Text": "一括リネーム情報"
					},
					"Key": "RenameNoChange"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Partial Success"
					},
					"Translation":
					{
						"Text": "一括リネームが部分的に成功しました"
					},
					"Key": "RenamePartialSuccess"
				},
				{
					"Source":
					{
						"Text": "Batch rename operation was canceled. Some items might not have been renamed."
					},
					"Translation":
					{
						"Text": "一括リネーム操作がキャンセルされました。一部のリネームが未実行の可能性があります。"
					},
					"Key": "RenameCanceled"
				},
				{
					"Source":
					{
						"Text": "Case Change:"
					},
					"Translation":
					{
						"Text": "大文字小文字変更（英字のみ対応）："
					},
					"Key": "CaseChangeLabel"
				},
				{
					"Source":
					{
						"Text": "Enable Regex:"
					},
					"Translation":
					{
						"Text": "正規表現を有効にする："
					},
					"Key": "EnableRegexLabel"
				},
				{
					"Source":
					{
						"Text": "Failed to rename {0} items. See log for details."
					},
					"Translation":
					{
						"Text": "リネームに失敗した項目数 {0}。 詳細は出力ログをご確認ください。命名が規範に適合していることを確認してください。"
					},
					"Key": "RenameFailedFormat"
				},
				{
					"Source":
					{
						"Text": "Find Text:"
					},
					"Translation":
					{
						"Text": "テキストを検索："
					},
					"Key": "FindTextLabel"
				},
				{
					"Source":
					{
						"Text": "Hint: English names are recommended."
					},
					"Translation":
					{
						"Text": "ご注意： 意図しない問題を避けるため、英字での命名を推奨します。"
					},
					"Key": "RenameHint"
				},
				{
					"Source":
					{
						"Text": "Manual Name"
					},
					"Translation":
					{
						"Text": "手動で命名"
					},
					"Key": "ManualNameColumn"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "変更なし"
					},
					"Key": "CaseChange_NoChange"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "変更なし"
					},
					"Key": "CaseChange_NoChange_Current"
				},
				{
					"Source":
					{
						"Text": "No items needed renaming (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "リネーム対象の選択項目がありません（名前が変更されていない可能性があります；項目が選択されていません）"
					},
					"Key": "NoRenameNeeded"
				},
				{
					"Source":
					{
						"Text": "No items were renamed (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "リネームが実行された項目はありません（名前が変更されていないか、対象項目が選択されていない可能性があります）"
					},
					"Key": "RenameNoChangeMessage"
				},
				{
					"Source":
					{
						"Text": "Original Name"
					},
					"Translation":
					{
						"Text": "元の名前"
					},
					"Key": "OriginalNameColumn"
				},
				{
					"Source":
					{
						"Text": "Padding Digits:"
					},
					"Translation":
					{
						"Text": "番号間隔："
					},
					"Key": "PaddingDigitsLabel"
				},
				{
					"Source":
					{
						"Text": "Please select assets in the Content Browser or actors in the Outliner to begin batch renaming."
					},
					"Translation":
					{
						"Text": "一括リネームを開始する前に、コンテンツ ブラウザー内の Asset またはアウトライナー内の Actor を選択してください。"
					},
					"Key": "NoSelectionMessage"
				},
				{
					"Source":
					{
						"Text": "Prefix:"
					},
					"Translation":
					{
						"Text": "接頭辞："
					},
					"Key": "PrefixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Preview Name"
					},
					"Translation":
					{
						"Text": "名前のプレビュー"
					},
					"Key": "PreviewNameColumn"
				},
				{
					"Source":
					{
						"Text": "Processing Actors..."
					},
					"Translation":
					{
						"Text": "複数の Actor を処理中..."
					},
					"Key": "ProcessingActors"
				},
				{
					"Source":
					{
						"Text": "Processing Assets..."
					},
					"Translation":
					{
						"Text": "複数の Asset を処理中..."
					},
					"Key": "ProcessingAssets"
				},
				{
					"Source":
					{
						"Text": "Regex pattern to find (e.g., '^(BP_)')"
					},
					"Translation":
					{
						"Text": "正規表現パターンを使用して検索（例：^(BP_)）"
					},
					"Key": "RegexFindTextHint"
				},
				{
					"Source":
					{
						"Text": "Renamed {0} items. Failed to rename {1} items."
					},
					"Translation":
					{
						"Text": "リネーム成功項目数 {0}。 リネーム失敗項目数 {1}"
					},
					"Key": "RenamePartialSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Renaming Assets and Actors..."
					},
					"Translation":
					{
						"Text": "複数の Asset と Actor をリネーム中"
					},
					"Key": "RenamingAssetsAndActors"
				},
				{
					"Source":
					{
						"Text": "Replace With:"
					},
					"Translation":
					{
						"Text": "置換する内容："
					},
					"Key": "ReplaceTextLabel"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Lower"
					},
					"Translation":
					{
						"Text": "置換する文字を小文字に変換"
					},
					"Key": "CaseChange_ReplacedToLower"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Upper"
					},
					"Translation":
					{
						"Text": "置換する文字を大文字に変換"
					},
					"Key": "CaseChange_ReplacedToUpper"
				},
				{
					"Source":
					{
						"Text": "Reset Rules"
					},
					"Translation":
					{
						"Text": "ルールをリセット"
					},
					"Key": "ResetRulesButton"
				},
				{
					"Source":
					{
						"Text": "Start Number:"
					},
					"Translation":
					{
						"Text": "開始番号："
					},
					"Key": "StartNumberLabel"
				},
				{
					"Source":
					{
						"Text": "Successfully renamed {0} items."
					},
					"Translation":
					{
						"Text": "リネームに成功した項目数 {0}"
					},
					"Key": "RenameSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Suffix:"
					},
					"Translation":
					{
						"Text": "接尾辞："
					},
					"Key": "SuffixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Text to find..."
					},
					"Translation":
					{
						"Text": "検索するテキスト..."
					},
					"Key": "FindTextHint"
				},
				{
					"Source":
					{
						"Text": "Text to replace with..."
					},
					"Translation":
					{
						"Text": "置換するテキスト..."
					},
					"Key": "ReplaceTextHint"
				},
				{
					"Source":
					{
						"Text": "Type"
					},
					"Translation":
					{
						"Text": "タイプ"
					},
					"Key": "TypeColumn"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "不明"
					},
					"Key": "CaseChange_Unknown"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "不明"
					},
					"Key": "CaseChange_Unknown_Current"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "不明"
					},
					"Key": "ItemType_Unknown"
				},
				{
					"Source":
					{
						"Text": "Use Numbering:"
					},
					"Translation":
					{
						"Text": "番号付けを使用する："
					},
					"Key": "NumberingLabel"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "すべての文字を小文字に変換"
					},
					"Key": "CaseChange_ToLower_Current"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "すべての文字を小文字に変換"
					},
					"Key": "CaseChange_ToLower"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "すべての文字を大文字に変換"
					},
					"Key": "CaseChange_ToUpper"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "すべての文字を大文字に変換"
					},
					"Key": "CaseChange_ToUpper_Current"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FEasyBatchRenamerModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Bring up EasyBatchRenamer window"
							},
							"Translation":
							{
								"Text": "簡易一括リネームツール ウィンドウを開く"
							},
							"Key": "OpenPluginWindow_ToolTip"
						},
						{
							"Source":
							{
								"Text": "EasyBatchRenamer"
							},
							"Translation":
							{
								"Text": "簡易一括リネーム"
							},
							"Key": "OpenPluginWindow"
						}
					]
				}
			]
		}
	]
}